test/load/load-test.yml
config:
  target: http://localhost:8080
  phases:
    # Fase 1: Carga inicial gradual
    - duration: 30
      arrivalRate: 2  # 2 nuevos usuarios por segundo
    # Fase 2: Carga media
    - duration: 60
      arrivalRate: 5  # 5 nuevos usuarios por segundo
    # Fase 3: Carga alta
    - duration: 30
      arrivalRate: 10  # 10 nuevos usuarios por segundo
  processor: "./custom-functions.js"
  http:
    timeout: 60  # Aumentado de 30 a 60 segundos para dar más tiempo

scenarios:
  - name: "Simular visitantes navegando el sitio"
    weight: 100
    beforeRequest: "generateRandomVisitor"
    flow:
      # Entrada inicial al sitio
      - get:
          url: "/"
          headers:
            User-Agent: "Artillery-Visitor-{{ $randomNumber(1, 10000) }}"
            Accept: "text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8"
            Accept-Language: "es-ES,es;q=0.5"
            Accept-Encoding: "gzip, deflate"
            Connection: "keep-alive"
            Upgrade-Insecure-Requests: "1"
          cookie:
            visitorId: "{{ visitorId }}"
            sessionId: "{{ sessionId }}"
      
      # Simular carga de recursos estáticos (como haría un navegador)
      - get:
          url: "/style.css"
          headers:
            Accept: "text/css,*/*;q=0.1"
            Referer: "http://localhost:8080/"
            User-Agent: "Artillery-Visitor-{{ $randomNumber(1, 10000) }}"
          cookie:
            visitorId: "{{ visitorId }}"
            sessionId: "{{ sessionId }}"
      
      # Simular carga del script del SDK (si está en el mismo dominio)
      - get:
          url: "/sdk/index.js"
          headers:
            Accept: "*/*"
            Referer: "http://localhost:8080/"
            User-Agent: "Artillery-Visitor-{{ $randomNumber(1, 10000) }}"
          cookie:
            visitorId: "{{ visitorId }}"
            sessionId: "{{ sessionId }}"
      
      # Breve pausa para simular tiempo de procesamiento de JavaScript
      - think: 2
      
      # Simular posibles llamadas AJAX que haría el JavaScript
      - get:
          url: "/api/tracking/page-view"
          headers:
            Accept: "application/json, text/plain, */*"
            Content-Type: "application/json"
            Referer: "http://localhost:8080/"
            User-Agent: "Artillery-Visitor-{{ $randomNumber(1, 10000) }}"
          cookie:
            visitorId: "{{ visitorId }}"
            sessionId: "{{ sessionId }}"
      
      # Pausa de 10 segundos antes de cerrar la sesión
      # Esto permite que todas las peticiones se procesen correctamente
      - think: 10